{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Brian&#39;s Blog",
	"language": "en",
	"home_page_url": "https://brianroberg.com/",
	"feed_url": "https://brianroberg.com/feed/feed.json",
	"description": "Thoughts on ideas concerning the church, society, and technology",
	"author": {
		"name": "Brian Roberg",
		"url": "https://brianroberg.com/about-me/"
	},
	"items": [
		{
			"id": "https://brianroberg.com/blog/fifthpost/",
			"url": "https://brianroberg.com/blog/fifthpost/",
			"title": "This is a fifth post (draft)",
			"content_html": "<p>This is a draft post</p>\n",
			"date_published": "2023-01-23T00:00:00Z"
		}
		,
		{
			"id": "https://brianroberg.com/blog/essentialism/",
			"url": "https://brianroberg.com/blog/essentialism/",
			"title": "Book Review: Essentialism by Greg McKeown",
			"content_html": "<p>It is possible to read Greg McKeown’s 2014 book <em>Essentialism: The Disciplined Pursuit of Less</em> as a collection of techniques for time management. There is some promise to this approach, as McKeown has gathered together a number of astute observations and suggestions to help readers better manage their priorities. But overall I believe that anyone who truly wants to improve their productivity would do better to skip this book.</p>\n<p>Before I describe where I see this book falling short, I'll give it credit for its strengths. There are some good reasons that people I respect have found this book valuable enough to make it required reading in DiscipleMakers’ staff training program.</p>\n<p>The principal strength of the book is that it unflinchingly presents the inescapability of trade-offs in decision-making. As Oliver Burkeman described in <a href=\"https://brianroberg.micro.blog/2022/01/31/book-review-four.html\"><em>Four Thousand Weeks,</em></a> there is a tendency among productivity gurus to promise that, if only you master their technique, you will be able to achieve all your life’s ambitions without having to say “no” to any deeply-held desires. McKeown rejects this false promise, early and often. In fact, the characteristic flaw of McKeown’s “Non-Essentialist” bogeyman is his inability (or unwillingness) to admit that we can only say “yes” to one thing by saying “no” to many other things.</p>\n<p>If realism about trade-offs is the main strength of the book, it also does a good job presenting various corollary arguments. For example, McKeown convincingly describes the dangers of over-optimistic planning and makes a good case for the importance of including buffer in our schedules. He provides a useful survey of research into cognitive biases that affect our decision-making. Also, his discussion of the value of routine and habit confirmed my inclination to read further on this topic. While there were points when his manner of presentation verges on the trivial, the book undoubtedly has some solid content.</p>\n<p>That said, my overall evaluation of the book is not positive. In fact, I feel I can't write about this book  without describing the magnitude of my subjective reaction to it. I found myself viscerally disliking the book to a degree I rarely experience. While many complaints come to mind, I will focus my critique to two points: one concerning style, the other a matter of more substance.</p>\n<p>Stylistically, I found McKeown's approach to his topic to be off-puttingly pretentious. As I've said, the book contains some solid content relating to time management and prioritization. But McKeown talks a much bigger game than that. He wants you to believe that Essentialism(TM) will transform your life and unlock a life of true fulfillment. He says this explicitly in his concluding chapter, but he works to build an aura of grandeur throughout the book. He often does this by associating his ideas with the lives of revered people, including Rosa Parks and Mohandas Gandhi. Or he draws (superficial) connections to the ideas of noted  thinkers. At one point he name-drops Aristotle and Heidegger in the same paragraph. But I found all this unconvincing. The overall impression is that of a business school student wearing a philosophy department sweatshirt.</p>\n<p>But my biggest objection with <em>Essentialism</em> is not its pretentious lack of substance. The substance it does have is even more troubling.</p>\n<p>Notwithstanding his puffed-up presentation, McKeown does make claims about what it means to live a virtuous life. The problem is that his system of ethics is thoroughly unbiblical. The highest ethical imperative for the Essentialist is not to love God or to love other people; it is to realize one's own ambitions. The Essentialist must steadfastly reject opportunities that do not advance his own interests, period. Self-sacrificial service is moral failure. And he doesn't merely imply this. He states it explicitly, and even strengthens his case by invoking respected figures like Peter Drucker who make the same claim. The instances in which he praises people for choosing to spend time with loved ones are not counter-examples, because in these cases the Essentialist has decided that investing in those relationships is what self-actualization looks like (for now).</p>\n<p>And here is why I believe that the technical merits of <em>Essentialism</em> do not make up for its faults: McKeown's  productivity advice and his self-centered framework are inextricably linked. While some chapters contain more self-advancement than others, this ethic is the foundation of the book. It's what gives McKeown leverage in his exhortations that we slim down our commitments. It's what allows him to propose heuristics like his &quot;90% Rule&quot; without getting bogged down in questions of justice for the people affected by our decisions (such as job applicants). It's how he can talk up the value of setting boundaries in relationships without troubling himself to distinguish the difference between enabling and helping. In sum, whenever the interests of another person start to impinge on a would-be Essentialist's personal agenda, he offers a license to write that person off like a bad debt.</p>\n<p>These considerations lead me to conclude that whatever assets the book may have, its liabilities far outweigh them. As I noted at the beginning, it comes closest if your aim is simply to gain some insight into techniques for time management. But if this is your goal, I suggest you would do better to go right to the source and read the <em>Harvard Business Review</em> articles that represent the wisdom of the business school world. If you want to go deeper with a book that explores the intersection of technique and biblical motivation, I'd suggest Matt Perman's <em>What's Best Next</em>. While it's been quite a while since I read that book,  I'm considering picking it up again. I suspect I may find even more value in it now by contrast with <em>Essentialism.</em></p>\n",
			"date_published": "2022-03-07T00:00:00Z"
		}
		,
		{
			"id": "https://brianroberg.com/blog/fourthpost/",
			"url": "https://brianroberg.com/blog/fourthpost/",
			"title": "This is my fourth post!",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://brianroberg.com/img/IdthKOzqFA-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://brianroberg.com/img/IdthKOzqFA-350.webp 350w\"><img alt=\"A possum parent and two possum kids hanging from the iconic red balloon\" loading=\"lazy\" decoding=\"async\" src=\"https://brianroberg.com/img/IdthKOzqFA-350.png\" width=\"350\" height=\"685\"></picture></p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/fourthpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-09-30T00:00:00Z"
		}
		,
		{
			"id": "https://brianroberg.com/blog/thirdpost/",
			"url": "https://brianroberg.com/blog/thirdpost/",
			"title": "This is my third post.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<h2 id=\"code\" tabindex=\"-1\">Code <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/thirdpost/\">#</a></h2>\n<h3 id=\"styled-with-syntax\" tabindex=\"-1\">Styled (with Syntax) <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/thirdpost/\">#</a></h3>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<pre class=\"language-js\" tabindex=\"0\"><code class=\"language-js\"><span class=\"token comment\">// this is a command</span>\n<span class=\"token keyword\">function</span> <span class=\"token function\">myCommand</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n\t<span class=\"token keyword\">let</span> counter <span class=\"token operator\">=</span> <span class=\"token number\">0</span><span class=\"token punctuation\">;</span>\n\tcounter<span class=\"token operator\">++</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token comment\">// Test with a line break above this line.</span>\nconsole<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span><span class=\"token string\">'Test'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<h3 id=\"unstyled\" tabindex=\"-1\">Unstyled <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/thirdpost/\">#</a></h3>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<pre><code>// this is a command\nfunction myCommand() {\n\tlet counter = 0;\n\tcounter++;\n}\n\n// Test with a line break above this line.\nconsole.log('Test');\n</code></pre>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/thirdpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-08-24T00:00:00Z"
		}
		,
		{
			"id": "https://brianroberg.com/blog/secondpost/",
			"url": "https://brianroberg.com/blog/secondpost/",
			"title": "This is my second post with a much longer title.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://brianroberg.com/blog/secondpost/\">#</a></h2>\n<p><a href=\"https://brianroberg.com/blog/firstpost/\">First post</a>\n<a href=\"https://brianroberg.com/blog/thirdpost/\">Third post</a></p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-07-04T00:00:00Z"
		}
		
	]
}
